openenergymonitor/STM32/Software/Sombrero_VE_Working6/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    current_millis = HAL_GetTick();

    // process_ds18b20s();
    
    //------------------------------------------
    // Interval for accumulating power readings.
    //------------------------------------------
    if (current_millis - previous_millis_fine >= readings_interval) 
    {
      uint16_t correction = current_millis - previous_millis_fine - posting_interval;
      previous_millis_fine = current_millis - correction;

      //RTC_CalendarShow(aShowTime, aShowDate);
      //debug_printf((char*)aShowDate); debug_printf("\r\n");
      //debug_printf((char*)aShowTime); debug_printf("\r\n");

      if (readings_requested) debug_printf("No voltage waveform present.\r\n");
      //if (testing) goto debugIrms;
      // implement default Vrms value setting and automatic calc of Irms and approximated Power value?
      readings_requested = true;
    }
    

    //------------------------------------------------
    // ADC DMA buffer flags. Process Frames.
    //------------------------------------------------
    if (conv_hfcplt_flag)
    {
      conv_hfcplt_flag = false;
      process_frame(0); // process 1st half of buffer.
    }
    if (conv_cplt_flag)
    {
      conv_cplt_flag = false;
      process_frame(adc_buff_half_size); // process 2nd half of buffer.
    }
    // HAL_Delay(200); // ADC buffer overrun flag test.


    
    //------------------------------------------------
    // To post primary data.
    //------------------------------------------------
    if (readings_ready)
    {
      /**************
      // buffer test, print all values.
      char currentSampleString[200] = {0};
      char voltageSampleString[200] = {0};
      char itoabuff[10];
     
      while(1)
      {
        HAL_ADC_Stop_DMA(&hadc1);
        HAL_ADC_Stop_DMA(&hadc3);
        for  (int i = 0; i < adc_buff_size; i+=CTn)
        {
          while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
          sprintf(log_buffer, "%d\r\n", adc3_dma_buff[i];
          debug_printf(log_buffer);
        }
        HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET);
        while(1);
      }
      // end buffer test
      **************/

      readings_ready = false; memset(channel_rdy_bools, 0, sizeof(channel_rdy_bools)); // clear flags.
      if (!first_readings) { posting_interval = _posting_interval; first_readings = true; goto EndJump; } // discard the first set as beginning of 1st waveform not tracked.
      
      while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
      sprintf(log_buffer, "{STM:1.0,\r\n"); // initital write to buffer.

      // CALCULATE POWER
      for (int ch = 0; ch < CTn; ch++)
      {
        channel_t *chn = &channels_ready[ch];
        channel_results_t *chn_result = &channel_results[ch];

        last_powerFactor[ch] = powerFactor_now[ch];
        calcPower(ch);
        powerFactor_now[ch] = powerFactor;
        pfHunt(ch);

        if (chn->Iclipped) chn_result->Clipped = true;

        if (ch == 0) { // estimate mains_frequency on a single channel, no need for more.
          mains_frequency = 1.0/(((chn->samplecount * CTn) / chn->cycles) * adc_conversion_time);
        }

        chn_result->Vrms += Vrms;
        chn_result->Irms += Irms;
        chn_result->ApparentPower += apparentPower;
        chn_result->RealPower += realPower;
        chn_result->PowerFactor += powerFactor;
        chn_result->Mains_AC_Cycles += chn->cycles;
        chn_result->SampleCount += chn->samplecount;
        chn_result->Count++;
      }
    }

    if (current_millis - previous_millis_course >= posting_interval) { // now to take the channel results, average them and post them.

      uint16_t correction = current_millis - previous_millis_fine - posting_interval;
      previous_millis_fine = current_millis - correction;

      if(ledBlink){HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_SET); } // blink the led
      
      

      for (int ch = 0; ch < CTn; ch++) {
        channel_results_t *chn_result = &channel_results[ch];

        chn_result->Vrms /= chn_result->Count;
        chn_result->Irms /= chn_result->Count;
        chn_result->ApparentPower /= chn_result->Count;
        chn_result->RealPower /= chn_result->Count;
        chn_result->PowerFactor /= chn_result->Count;

        int _ch = ch + 1; // nicer looking channel numbers. First channel starts at 1 instead of 0.
        //if (_ch == 1) { // single channel debug output.
        sprintf(string_buffer, "V%d:%.2lf,I%d:%.3lf,AP%d:%.1lf,RP%d:%.1lf,PF%d:%.6lf,Joules%d:%.3lf,Clip%d:%d,cycles%d:%d,samples%d:%ld,\r\n", _ch, chn_result->Vrms, _ch, chn_result->Irms, _ch, chn_result->ApparentPower, _ch, chn_result->RealPower, _ch, chn_result->PowerFactor, _ch, Ws_accumulator[ch], _ch, chn_result->Clipped, _ch, chn_result->Mains_AC_Cycles, _ch, chn_result->SampleCount);
        strcat(log_buffer, string_buffer);
        //} // single channel debug output.
      }
      

      // Main frequency estimate.
      sprintf(string_buffer, "Hz:%.1f,", mains_frequency);
      strcat(log_buffer, string_buffer);
      
      // Millis
      sprintf(string_buffer, "millis:%ld,", current_millis);
      strcat(log_buffer, string_buffer);
      
      // Pulsecount
      sprintf(string_buffer, "PC:%ld,", pulseCount);
      strcat(log_buffer, string_buffer);
      
      // has the adc buffer overrun?
      sprintf(string_buffer, "buffOverrun:%d", adc_buffer_overflow);
      adc_buffer_overflow = 0; // reset
      strcat(log_buffer, string_buffer);

      // close the string and add some whitespace for clarity.
      strcat(log_buffer, "}\r\n");
      debug_printf(log_buffer);

      // RFM69 send.
      if (radioSender) // sending data, test data only.
      {
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink) { HAL_GPIO_WritePin(LED3_GPIO_Port, LED3_Pin, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
        debug_printf("radio Tx\r\n");
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }

      // reset accumulators.
      for (int ch = 0; ch < CTn; ch++) {
              channel_results_t *chn_result = &channel_results[ch];
              memset((void*)chn_result, 0, sizeof(channel_results_t));
      }
      
      if(ledBlink){HAL_GPIO_WritePin(LED2_GPIO_Port, LED2_Pin, GPIO_PIN_RESET);}
    } EndJump: // end main readings_ready function.
    // end main readings_ready function.
    // end main readings_ready function.
    // end main readings_ready function.



    //-------------------------------
    // RFM69 Rx
    //-------------------------------
    // This needs checking, does a flag need generating from a DIO0 read = true?
    if(radioReceiver) {
      if (RFM69_ReadDIO0Pin()) {
        debug_printf("RFM69 DIO0 high.\r\n");
        //RFM69_interruptHandler();
        if (RFM69_receiveDone()) { // this maybe shouldn't be nested in the previous if(). If Rx doesn't work, could be the problem.
          HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
          HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
          // debug output below.
          debug_printf("RFM69 payload received.\r\n");
          PrintRawBytes();
          //PrintStruct();
          //PrintByteByByte();
          //RFM69_interruptHandler();
          while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
          sprintf(log_buffer, "RSSI:%d\r\n", rssi);
          debug_printf(log_buffer);

          RFM69_receiveBegin();
          //RFM69_receiveDone(); // seems to be required.
        }
      }
    } // end radioReceiver


    
    /*  // below for testing radio Noise
    if (radioSender) // sending data, test data only.
      {
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); // LED blink
        HAL_TIM_Base_Start_IT(&htim16); // LED blink, interrupt based.
        radioData.nodeId = nodeID;
        radioData.uptime = HAL_GetTick();
        if(ledBlink){HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8, 1); HAL_TIM_Base_Start_IT(&htim16); }// LED blink
        RFM69_send(toAddress, (const void *)(&radioData), sizeof(radioData), requestACK);
        //RFM69_sendWithRetry(toAddress, (const void *)(&radioData), sizeof(radioData), 3,20);
      }
    */



    //------------------------
    // UART Rx check
    //------------------------
    if (usart1_rx_flag)
    {
      usart1_rx_flag = 0;
      memcpy(rx_string, rx_buff, sizeof(rx_buff));
      memset(rx_buff, 0, sizeof(rx_buff));
      huart1.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
      huart1.hdmarx->Instance->CNDTR = sizeof(rx_buff);
      huart1.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
      //json_parser("{G:RTC}"); // calling this loads json_response[] with a response.
      json_parser(rx_string); // calling this loads json_response[] with a response.
      while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
      sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
      debug_printf(log_buffer);
    }
    // if (usart2_rx_flag)
    // {
    //   //-----
    //     //phase_corrections[0] = 13; // slap a value in there to test with.
    //     //hunt_PF[0] = true; // test powerfactor hunting on CT1.
    //   //-----
    //   usart2_rx_flag = 0;
    //   memcpy(rx_string, rx_buff, sizeof(rx_buff));
    //   memset(rx_buff, 0, sizeof(rx_buff));
    //   huart2.hdmarx->Instance->CCR &= ~DMA_CCR_EN;
    //   huart2.hdmarx->Instance->CNDTR = sizeof(rx_buff);
    //   huart2.hdmarx->Instance->CCR |= DMA_CCR_EN; // reset dma counter
    //   json_parser(rx_string); // calling this loads json_response[] with a response.
    //   while (!usart_tx_ready) __NOP(); // force wait while usart Tx finishes.
    //   sprintf(log_buffer, "{STM32:%s}\r\n", json_response);
    //   debug_printf(log_buffer);
    // }


    //-------------------------------
    // Print char buffers to serial.
    //-------------------------------
    // if (log_buffer[0] != '\0') { // null terminated strings!
    //   rPi_printf(log_buffer);
    //    // set index of string to null to effectively delete the string.
    //   // https://stackoverflow.com/questions/632846/clearing-a-char-array-c
    // }
    // if (log_buffer[0] != '\0') {
    //   rPi_printf(log_buffer);
    //   log_buffer[0] = '\0';
    // }
    

  /* USER CODE END WHILE */

